---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.DesignLightingLoad
source: html/0b0438f0-7b7e-d27a-e450-68b34c354259.htm
---
# Autodesk.Revit.DB.Mechanical.Space.DesignLightingLoad Property

Get or set the Design Lighting Load of the Space.

## Syntax (C#)
```csharp
public double DesignLightingLoad { get; set; }
```

## Remarks
This property is used to get or set the Design Lighting Load of the Space.